# -*- coding:utf-8 -*-

def solve():
    N = int(input())
    # N以下の整数のうち、桁数が奇数のものの数

    """
    100 ~ 999 = (1000 - 100)
    """

    ans = 0
    if N >= 10**5:  # 100000
        ans += (10**5 - 10**4)
        ans += (10**3 - 10**2)
        ans += (10**1 - 1)
    elif N >= 10**4:  # 10000
        ans += (N - 10**4 + 1)
        ans += (10**3 - 10**2)
        ans += (10**1 - 1)
    elif N >= 10**3:  # 1000
        ans += (10**3 - 10**2)
        ans += (10**1 - 1)
    elif N >= 10**2:  # 100
        ans += (N - 10**2 + 1)
        ans += (10**1 - 1)
    elif N >= 10**1:  # 10
        ans += (10**1 - 1)
    elif N >= 1:
        ans += N
    
    print(ans)

if __name__ == "__main__":
    solve()
